performance/mysql8-jemalloc-profiling/logs/old-runs/jemalloc360.run.oltp_point_select.512.2021-02-12_155721.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 512
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

1,512,330088.23,330088.23,330088.23,0.00,0.00,1.76,0.00,0.00
2,512,346263.98,346263.98,346263.98,0.00,0.00,1.73,0.00,0.00
3,512,346183.36,346183.36,346183.36,0.00,0.00,1.73,0.00,0.00
4,512,346289.77,346289.77,346289.77,0.00,0.00,1.76,0.00,0.00
5,512,346782.85,346782.85,346782.85,0.00,0.00,1.73,0.00,0.00
6,512,346487.55,346485.55,346485.55,0.00,0.00,1.73,0.00,0.00
7,512,346233.93,346233.93,346233.93,0.00,0.00,1.73,0.00,0.00
8,512,346280.77,346282.77,346282.77,0.00,0.00,1.73,0.00,0.00
9,512,346433.52,346431.52,346431.52,0.00,0.00,1.73,0.00,0.00
10,512,346278.84,346280.84,346280.84,0.00,0.00,1.73,0.00,0.00
11,512,346393.38,346393.38,346393.38,0.00,0.00,1.73,0.00,0.00
12,512,346848.73,346848.73,346848.73,0.00,0.00,1.73,0.00,0.00
13,512,346721.19,346721.19,346721.19,0.00,0.00,1.73,0.00,0.00
14,512,346305.69,346305.69,346305.69,0.00,0.00,1.73,0.00,0.00
15,512,346444.40,346444.40,346444.40,0.00,0.00,1.73,0.00,0.00
16,512,346255.34,346255.34,346255.34,0.00,0.00,1.73,0.00,0.00
17,512,346213.50,346213.50,346213.50,0.00,0.00,1.73,0.00,0.00
18,512,346194.37,346194.37,346194.37,0.00,0.00,1.73,0.00,0.00
19,512,346266.94,346266.94,346266.94,0.00,0.00,1.73,0.00,0.00
20,512,346206.09,346203.09,346203.09,0.00,0.00,1.73,0.00,0.00
21,512,346313.21,346314.21,346314.21,0.00,0.00,1.73,0.00,0.00
22,512,346203.74,346204.74,346204.74,0.00,0.00,1.73,0.00,0.00
23,512,346207.09,346206.09,346206.09,0.00,0.00,1.73,0.00,0.00
24,512,346151.72,346153.72,346153.72,0.00,0.00,1.73,0.00,0.00
25,512,346253.24,346253.24,346253.24,0.00,0.00,1.73,0.00,0.00
26,512,346068.20,346067.20,346067.20,0.00,0.00,1.73,0.00,0.00
27,512,346208.77,346207.77,346207.77,0.00,0.00,1.73,0.00,0.00
28,512,346200.19,346202.19,346202.19,0.00,0.00,1.73,0.00,0.00
29,512,346279.38,346279.38,346279.38,0.00,0.00,1.73,0.00,0.00
30,512,346157.91,346157.91,346157.91,0.00,0.00,1.73,0.00,0.00
31,512,346158.25,346158.25,346158.25,0.00,0.00,1.73,0.00,0.00
32,512,346184.39,346182.39,346182.39,0.00,0.00,1.73,0.00,0.00
33,512,346114.47,346116.47,346116.47,0.00,0.00,1.73,0.00,0.00
34,512,346127.65,346127.65,346127.65,0.00,0.00,1.73,0.00,0.00
35,512,346164.87,346161.87,346161.87,0.00,0.00,1.73,0.00,0.00
36,512,346047.74,346050.74,346050.74,0.00,0.00,1.73,0.00,0.00
37,512,346128.92,346128.92,346128.92,0.00,0.00,1.73,0.00,0.00
38,512,346132.73,346130.73,346130.73,0.00,0.00,1.73,0.00,0.00
39,512,346114.83,346116.83,346116.83,0.00,0.00,1.73,0.00,0.00
40,512,346246.26,346245.26,346245.26,0.00,0.00,1.76,0.00,0.00
41,512,346325.15,346326.15,346326.15,0.00,0.00,1.73,0.00,0.00
42,512,346327.71,346325.71,346325.71,0.00,0.00,1.73,0.00,0.00
43,512,346359.29,346361.29,346361.29,0.00,0.00,1.73,0.00,0.00
44,512,346296.75,346296.75,346296.75,0.00,0.00,1.76,0.00,0.00
45,512,346253.37,346253.37,346253.37,0.00,0.00,1.79,0.00,0.00
46,512,346231.32,346231.32,346231.32,0.00,0.00,1.73,0.00,0.00
47,512,346244.39,346242.39,346242.39,0.00,0.00,1.73,0.00,0.00
48,512,346189.60,346191.60,346191.60,0.00,0.00,1.73,0.00,0.00
49,512,346223.71,346221.71,346221.71,0.00,0.00,1.73,0.00,0.00
50,512,346131.95,346133.95,346133.95,0.00,0.00,1.73,0.00,0.00
51,512,346220.83,346218.83,346218.83,0.00,0.00,1.73,0.00,0.00
52,512,346172.11,346174.11,346174.11,0.00,0.00,1.73,0.00,0.00
53,512,346295.87,346295.87,346295.87,0.00,0.00,1.73,0.00,0.00
54,512,347633.37,347632.37,347632.37,0.00,0.00,1.73,0.00,0.00
55,512,346594.38,346594.38,346594.38,0.00,0.00,1.73,0.00,0.00
56,512,346264.82,346264.82,346264.82,0.00,0.00,1.73,0.00,0.00
57,512,346328.66,346329.66,346329.66,0.00,0.00,1.73,0.00,0.00
58,512,346319.40,346319.40,346319.40,0.00,0.00,1.73,0.00,0.00
59,512,346300.62,346300.62,346300.62,0.00,0.00,1.73,0.00,0.00
60,512,346321.95,346319.95,346319.95,0.00,0.00,1.73,0.00,0.00
61,512,346330.48,346332.48,346332.48,0.00,0.00,1.76,0.00,0.00
62,512,346297.26,346295.26,346295.26,0.00,0.00,1.79,0.00,0.00
63,512,346258.90,346260.90,346260.90,0.00,0.00,1.76,0.00,0.00
64,512,346167.20,346167.20,346167.20,0.00,0.00,1.73,0.00,0.00
65,512,346192.51,346192.51,346192.51,0.00,0.00,1.73,0.00,0.00
66,512,346160.47,346160.47,346160.47,0.00,0.00,1.73,0.00,0.00
67,512,348023.14,348022.14,348022.14,0.00,0.00,1.73,0.00,0.00
68,512,346153.00,346154.00,346154.00,0.00,0.00,1.73,0.00,0.00
69,512,346212.00,346212.00,346212.00,0.00,0.00,1.73,0.00,0.00
70,512,346314.08,346314.08,346314.08,0.00,0.00,1.73,0.00,0.00
71,512,346231.25,346230.25,346230.25,0.00,0.00,1.73,0.00,0.00
72,512,346164.72,346165.72,346165.72,0.00,0.00,1.73,0.00,0.00
73,512,346303.67,346303.67,346303.67,0.00,0.00,1.73,0.00,0.00
74,512,346171.40,346169.40,346169.40,0.00,0.00,1.73,0.00,0.00
75,512,346264.85,346266.85,346266.85,0.00,0.00,1.73,0.00,0.00
76,512,346260.13,346260.13,346260.13,0.00,0.00,1.73,0.00,0.00
77,512,346333.20,346333.20,346333.20,0.00,0.00,1.73,0.00,0.00
78,512,346183.32,346183.32,346183.32,0.00,0.00,1.79,0.00,0.00
79,512,346303.62,346300.62,346300.62,0.00,0.00,1.79,0.00,0.00
80,512,346254.42,346256.42,346256.42,0.00,0.00,1.79,0.00,0.00
81,512,346348.05,346347.05,346347.05,0.00,0.00,1.79,0.00,0.00
82,512,346255.03,346257.03,346257.03,0.00,0.00,1.79,0.00,0.00
83,512,346285.17,346284.17,346284.17,0.00,0.00,1.73,0.00,0.00
84,512,346265.95,346266.95,346266.95,0.00,0.00,1.73,0.00,0.00
85,512,346243.09,346242.09,346242.09,0.00,0.00,1.73,0.00,0.00
86,512,346174.81,346174.81,346174.81,0.00,0.00,1.73,0.00,0.00
87,512,346242.73,346243.73,346243.73,0.00,0.00,1.73,0.00,0.00
88,512,346230.56,346230.56,346230.56,0.00,0.00,1.73,0.00,0.00
89,512,346227.45,346227.45,346227.45,0.00,0.00,1.73,0.00,0.00
90,512,346217.63,346217.63,346217.63,0.00,0.00,1.73,0.00,0.00
91,512,346249.71,346249.71,346249.71,0.00,0.00,1.73,0.00,0.00
92,512,346249.10,346249.10,346249.10,0.00,0.00,1.73,0.00,0.00
93,512,346283.60,346283.60,346283.60,0.00,0.00,1.73,0.00,0.00
94,512,346179.21,346175.21,346175.21,0.00,0.00,1.73,0.00,0.00
95,512,346169.19,346173.19,346173.19,0.00,0.00,1.73,0.00,0.00
96,512,346118.46,346117.46,346117.46,0.00,0.00,1.73,0.00,0.00
97,512,346187.91,346188.91,346188.91,0.00,0.00,1.73,0.00,0.00
98,512,346138.78,346137.78,346137.78,0.00,0.00,1.73,0.00,0.00
99,512,346211.03,346208.03,346208.03,0.00,0.00,1.73,0.00,0.00
100,512,346177.91,346181.91,346181.91,0.00,0.00,1.73,0.00,0.00
101,512,346117.67,346115.67,346115.67,0.00,0.00,1.73,0.00,0.00
102,512,346145.68,346147.68,346147.68,0.00,0.00,1.73,0.00,0.00
103,512,346144.51,346144.51,346144.51,0.00,0.00,1.73,0.00,0.00
104,512,346144.73,346144.73,346144.73,0.00,0.00,1.73,0.00,0.00
105,512,346150.32,346150.32,346150.32,0.00,0.00,1.73,0.00,0.00
106,512,346087.98,346086.98,346086.98,0.00,0.00,1.73,0.00,0.00
107,512,346138.12,346138.12,346138.12,0.00,0.00,1.73,0.00,0.00
108,512,346144.06,346143.06,346143.06,0.00,0.00,1.73,0.00,0.00
109,512,346118.77,346120.77,346120.77,0.00,0.00,1.73,0.00,0.00
110,512,346169.18,346169.18,346169.18,0.00,0.00,1.73,0.00,0.00
111,512,346210.40,346208.40,346208.40,0.00,0.00,1.73,0.00,0.00
112,512,346176.70,346178.70,346178.70,0.00,0.00,1.73,0.00,0.00
113,512,346125.14,346125.14,346125.14,0.00,0.00,1.73,0.00,0.00
114,512,347053.91,347053.91,347053.91,0.00,0.00,1.73,0.00,0.00
115,512,346255.07,346253.07,346253.07,0.00,0.00,1.73,0.00,0.00
116,512,346170.10,346170.10,346170.10,0.00,0.00,1.73,0.00,0.00
117,512,346271.95,346273.95,346273.95,0.00,0.00,1.73,0.00,0.00
118,512,346207.07,346207.07,346207.07,0.00,0.00,1.73,0.00,0.00
119,512,346298.18,346296.18,346296.18,0.00,0.00,1.73,0.00,0.00
120,512,346225.24,346227.24,346227.24,0.00,0.00,1.73,0.00,0.00
121,512,346272.44,346270.44,346270.44,0.00,0.00,1.73,0.00,0.00
122,512,346260.43,346262.43,346262.43,0.00,0.00,1.73,0.00,0.00
123,512,346352.31,346351.31,346351.31,0.00,0.00,1.79,0.00,0.00
124,512,346275.95,346275.95,346275.95,0.00,0.00,1.73,0.00,0.00
125,512,346317.67,346317.67,346317.67,0.00,0.00,1.73,0.00,0.00
126,512,346184.23,346185.23,346185.23,0.00,0.00,1.73,0.00,0.00
127,512,347133.52,347133.52,347133.52,0.00,0.00,1.73,0.00,0.00
128,512,346589.68,346587.68,346587.68,0.00,0.00,1.73,0.00,0.00
129,512,346912.45,346914.45,346914.45,0.00,0.00,1.73,0.00,0.00
130,512,346216.28,346216.28,346216.28,0.00,0.00,1.73,0.00,0.00
131,512,346282.14,346282.14,346282.14,0.00,0.00,1.73,0.00,0.00
132,512,346264.98,346264.98,346264.98,0.00,0.00,1.73,0.00,0.00
133,512,346204.13,346204.13,346204.13,0.00,0.00,1.73,0.00,0.00
134,512,346231.24,346231.24,346231.24,0.00,0.00,1.73,0.00,0.00
135,512,346200.77,346200.77,346200.77,0.00,0.00,1.73,0.00,0.00
136,512,346286.09,346286.09,346286.09,0.00,0.00,1.73,0.00,0.00
137,512,346363.98,346361.98,346361.98,0.00,0.00,1.73,0.00,0.00
138,512,346308.97,346308.97,346308.97,0.00,0.00,1.73,0.00,0.00
139,512,346271.73,346273.73,346273.73,0.00,0.00,1.73,0.00,0.00
140,512,346403.85,346403.85,346403.85,0.00,0.00,1.79,0.00,0.00
141,512,346498.91,346498.91,346498.91,0.00,0.00,1.79,0.00,0.00
142,512,346364.56,346364.56,346364.56,0.00,0.00,1.79,0.00,0.00
143,512,346406.89,346405.89,346405.89,0.00,0.00,1.73,0.00,0.00
144,512,346389.87,346390.87,346390.87,0.00,0.00,1.73,0.00,0.00
145,512,346376.62,346376.62,346376.62,0.00,0.00,1.73,0.00,0.00
146,512,346259.88,346259.88,346259.88,0.00,0.00,1.73,0.00,0.00
147,512,346419.20,346419.20,346419.20,0.00,0.00,1.73,0.00,0.00
148,512,346449.47,346449.47,346449.47,0.00,0.00,1.76,0.00,0.00
149,512,346283.63,346283.63,346283.63,0.00,0.00,1.73,0.00,0.00
150,512,346311.92,346311.92,346311.92,0.00,0.00,1.73,0.00,0.00
151,512,346155.24,346154.24,346154.24,0.00,0.00,1.73,0.00,0.00
152,512,346248.66,346249.66,346249.66,0.00,0.00,1.73,0.00,0.00
153,512,346162.44,346162.44,346162.44,0.00,0.00,1.73,0.00,0.00
154,512,346189.15,346189.15,346189.15,0.00,0.00,1.73,0.00,0.00
155,512,346266.55,346264.55,346264.55,0.00,0.00,1.73,0.00,0.00
156,512,346193.65,346195.65,346195.65,0.00,0.00,1.73,0.00,0.00
157,512,346218.51,346218.51,346218.51,0.00,0.00,1.73,0.00,0.00
158,512,346232.88,346230.88,346230.88,0.00,0.00,1.73,0.00,0.00
159,512,346318.47,346320.47,346320.47,0.00,0.00,1.73,0.00,0.00
160,512,346246.45,346244.45,346244.45,0.00,0.00,1.73,0.00,0.00
161,512,345753.39,345755.39,345755.39,0.00,0.00,1.73,0.00,0.00
162,512,346012.61,346010.61,346010.61,0.00,0.00,1.73,0.00,0.00
163,512,346278.05,346280.05,346280.05,0.00,0.00,1.73,0.00,0.00
164,512,346338.18,346338.18,346338.18,0.00,0.00,1.73,0.00,0.00
165,512,347231.18,347230.18,347230.18,0.00,0.00,1.73,0.00,0.00
166,512,346387.62,346388.62,346388.62,0.00,0.00,1.73,0.00,0.00
167,512,346480.00,346480.00,346480.00,0.00,0.00,1.73,0.00,0.00
168,512,346300.29,346300.29,346300.29,0.00,0.00,1.73,0.00,0.00
169,512,346333.13,346333.13,346333.13,0.00,0.00,1.73,0.00,0.00
170,512,346280.48,346280.48,346280.48,0.00,0.00,1.73,0.00,0.00
171,512,346239.18,346239.18,346239.18,0.00,0.00,1.73,0.00,0.00
172,512,346297.46,346294.46,346294.46,0.00,0.00,1.73,0.00,0.00
173,512,346275.70,346278.70,346278.70,0.00,0.00,1.73,0.00,0.00
174,512,346283.90,346283.90,346283.90,0.00,0.00,1.73,0.00,0.00
175,512,346254.58,346254.58,346254.58,0.00,0.00,1.73,0.00,0.00
176,512,346244.54,346242.54,346242.54,0.00,0.00,1.73,0.00,0.00
177,512,346418.47,346420.47,346420.47,0.00,0.00,1.73,0.00,0.00
178,512,346371.45,346371.45,346371.45,0.00,0.00,1.73,0.00,0.00
179,512,346307.05,346307.05,346307.05,0.00,0.00,1.73,0.00,0.00
180,512,346299.25,346299.25,346299.25,0.00,0.00,1.73,0.00,0.00
181,512,346403.78,346401.78,346401.78,0.00,0.00,1.73,0.00,0.00
182,512,346279.93,346281.93,346281.93,0.00,0.00,1.73,0.00,0.00
183,512,346294.84,346292.84,346292.84,0.00,0.00,1.73,0.00,0.00
184,512,346309.58,346311.58,346311.58,0.00,0.00,1.73,0.00,0.00
185,512,346305.13,346304.13,346304.13,0.00,0.00,1.73,0.00,0.00
186,512,346126.00,346127.00,346127.00,0.00,0.00,1.73,0.00,0.00
187,512,346304.39,346304.39,346304.39,0.00,0.00,1.73,0.00,0.00
188,512,348263.19,348263.19,348263.19,0.00,0.00,1.76,0.00,0.00
189,512,346778.71,346778.71,346778.71,0.00,0.00,1.73,0.00,0.00
190,512,346246.03,346246.03,346246.03,0.00,0.00,1.73,0.00,0.00
191,512,346264.04,346264.04,346264.04,0.00,0.00,1.73,0.00,0.00
192,512,346342.75,346342.75,346342.75,0.00,0.00,1.73,0.00,0.00
193,512,346351.74,346351.74,346351.74,0.00,0.00,1.73,0.00,0.00
194,512,346358.55,346358.55,346358.55,0.00,0.00,1.73,0.00,0.00
195,512,346299.55,346299.55,346299.55,0.00,0.00,1.73,0.00,0.00
196,512,346252.78,346250.78,346250.78,0.00,0.00,1.73,0.00,0.00
197,512,346331.24,346333.24,346333.24,0.00,0.00,1.73,0.00,0.00
198,512,346219.93,346219.93,346219.93,0.00,0.00,1.73,0.00,0.00
199,512,346262.15,346261.15,346261.15,0.00,0.00,1.73,0.00,0.00
200,512,346202.89,346203.89,346203.89,0.00,0.00,1.73,0.00,0.00
201,512,346290.13,346288.13,346288.13,0.00,0.00,1.73,0.00,0.00
202,512,346242.22,346243.22,346243.22,0.00,0.00,1.73,0.00,0.00
203,512,346311.60,346312.60,346312.60,0.00,0.00,1.73,0.00,0.00
204,512,346352.17,346352.17,346352.17,0.00,0.00,1.73,0.00,0.00
205,512,347256.94,347256.94,347256.94,0.00,0.00,1.73,0.00,0.00
206,512,346406.74,346404.74,346404.74,0.00,0.00,1.73,0.00,0.00
207,512,346357.13,346359.13,346359.13,0.00,0.00,1.73,0.00,0.00
208,512,346354.79,346354.79,346354.79,0.00,0.00,1.73,0.00,0.00
209,512,346330.98,346328.98,346328.98,0.00,0.00,1.73,0.00,0.00
210,512,346179.35,346181.35,346181.35,0.00,0.00,1.73,0.00,0.00
211,512,346275.55,346275.55,346275.55,0.00,0.00,1.76,0.00,0.00
212,512,346745.66,346745.66,346745.66,0.00,0.00,1.79,0.00,0.00
213,512,346819.62,346819.62,346819.62,0.00,0.00,1.79,0.00,0.00
214,512,346411.34,346411.34,346411.34,0.00,0.00,1.79,0.00,0.00
215,512,346362.32,346360.32,346360.32,0.00,0.00,1.79,0.00,0.00
216,512,346344.56,346346.56,346346.56,0.00,0.00,1.79,0.00,0.00
217,512,346316.25,346314.25,346314.25,0.00,0.00,1.76,0.00,0.00
218,512,346278.64,346280.64,346280.64,0.00,0.00,1.73,0.00,0.00
219,512,346339.63,346337.63,346337.63,0.00,0.00,1.73,0.00,0.00
220,512,346328.28,346330.28,346330.28,0.00,0.00,1.73,0.00,0.00
221,512,345805.70,345804.70,345804.70,0.00,0.00,1.73,0.00,0.00
222,512,346197.83,346198.83,346198.83,0.00,0.00,1.73,0.00,0.00
223,512,346097.62,346097.62,346097.62,0.00,0.00,1.73,0.00,0.00
224,512,346349.91,346349.91,346349.91,0.00,0.00,1.73,0.00,0.00
225,512,346348.69,346348.69,346348.69,0.00,0.00,1.76,0.00,0.00
226,512,346314.91,346314.91,346314.91,0.00,0.00,1.79,0.00,0.00
227,512,346366.01,346366.01,346366.01,0.00,0.00,1.79,0.00,0.00
228,512,346317.93,346317.93,346317.93,0.00,0.00,1.79,0.00,0.00
229,512,346418.87,346416.87,346416.87,0.00,0.00,1.76,0.00,0.00
230,512,346369.43,346370.43,346370.43,0.00,0.00,1.76,0.00,0.00
231,512,346354.36,346355.36,346355.36,0.00,0.00,1.79,0.00,0.00
232,512,346360.09,346358.09,346358.09,0.00,0.00,1.76,0.00,0.00
233,512,346371.15,346373.15,346373.15,0.00,0.00,1.73,0.00,0.00
234,512,347215.57,347215.57,347215.57,0.00,0.00,1.73,0.00,0.00
235,512,346465.09,346464.09,346464.09,0.00,0.00,1.73,0.00,0.00
236,512,346335.09,346336.09,346336.09,0.00,0.00,1.73,0.00,0.00
237,512,346418.51,346418.51,346418.51,0.00,0.00,1.73,0.00,0.00
238,512,346302.18,346302.18,346302.18,0.00,0.00,1.73,0.00,0.00
239,512,346236.77,346236.77,346236.77,0.00,0.00,1.73,0.00,0.00
240,512,346407.25,346407.25,346407.25,0.00,0.00,1.73,0.00,0.00
241,512,346238.31,346238.31,346238.31,0.00,0.00,1.73,0.00,0.00
242,512,346316.12,346316.12,346316.12,0.00,0.00,1.73,0.00,0.00
243,512,346336.06,346336.06,346336.06,0.00,0.00,1.73,0.00,0.00
244,512,347123.01,347123.01,347123.01,0.00,0.00,1.73,0.00,0.00
245,512,346355.06,346355.06,346355.06,0.00,0.00,1.73,0.00,0.00
246,512,346340.74,346340.74,346340.74,0.00,0.00,1.73,0.00,0.00
247,512,346353.58,346350.58,346350.58,0.00,0.00,1.73,0.00,0.00
248,512,346357.92,346358.92,346358.92,0.00,0.00,1.73,0.00,0.00
249,512,346380.20,346382.20,346382.20,0.00,0.00,1.79,0.00,0.00
250,512,346359.41,346357.41,346357.41,0.00,0.00,1.79,0.00,0.00
251,512,346389.98,346391.98,346391.98,0.00,0.00,1.79,0.00,0.00
252,512,346382.01,346382.01,346382.01,0.00,0.00,1.76,0.00,0.00
253,512,346361.60,346361.60,346361.60,0.00,0.00,1.73,0.00,0.00
254,512,346392.87,346392.87,346392.87,0.00,0.00,1.73,0.00,0.00
255,512,346328.29,346328.29,346328.29,0.00,0.00,1.73,0.00,0.00
256,512,346273.45,346273.45,346273.45,0.00,0.00,1.73,0.00,0.00
257,512,346356.50,346356.50,346356.50,0.00,0.00,1.73,0.00,0.00
258,512,346300.25,346300.25,346300.25,0.00,0.00,1.73,0.00,0.00
259,512,346349.09,346349.09,346349.09,0.00,0.00,1.73,0.00,0.00
260,512,346405.95,346405.95,346405.95,0.00,0.00,1.73,0.00,0.00
261,512,346412.79,346412.79,346412.79,0.00,0.00,1.73,0.00,0.00
262,512,346359.46,346356.46,346356.46,0.00,0.00,1.73,0.00,0.00
263,512,346396.19,346399.19,346399.19,0.00,0.00,1.73,0.00,0.00
264,512,347246.32,347246.32,347246.32,0.00,0.00,1.73,0.00,0.00
265,512,346383.51,346383.51,346383.51,0.00,0.00,1.73,0.00,0.00
266,512,346326.72,346326.72,346326.72,0.00,0.00,1.73,0.00,0.00
267,512,346357.93,346356.93,346356.93,0.00,0.00,1.73,0.00,0.00
268,512,346403.38,346404.38,346404.38,0.00,0.00,1.73,0.00,0.00
269,512,346464.24,346464.24,346464.24,0.00,0.00,1.73,0.00,0.00
270,512,346481.83,346481.83,346481.83,0.00,0.00,1.73,0.00,0.00
271,512,346468.66,346468.66,346468.66,0.00,0.00,1.73,0.00,0.00
272,512,346427.33,346427.33,346427.33,0.00,0.00,1.73,0.00,0.00
273,512,346406.63,346406.63,346406.63,0.00,0.00,1.73,0.00,0.00
274,512,346367.68,346365.68,346365.68,0.00,0.00,1.73,0.00,0.00
275,512,346349.23,346351.23,346351.23,0.00,0.00,1.73,0.00,0.00
276,512,346488.14,346486.14,346486.14,0.00,0.00,1.73,0.00,0.00
277,512,346500.45,346502.45,346502.45,0.00,0.00,1.73,0.00,0.00
278,512,346420.26,346420.26,346420.26,0.00,0.00,1.73,0.00,0.00
279,512,346387.09,346387.09,346387.09,0.00,0.00,1.73,0.00,0.00
280,512,346457.72,346457.72,346457.72,0.00,0.00,1.73,0.00,0.00
281,512,346451.60,346451.60,346451.60,0.00,0.00,1.73,0.00,0.00
282,512,346498.49,346497.49,346497.49,0.00,0.00,1.76,0.00,0.00
283,512,346485.26,346486.26,346486.26,0.00,0.00,1.79,0.00,0.00
284,512,347238.55,347238.55,347238.55,0.00,0.00,1.76,0.00,0.00
285,512,346428.37,346428.37,346428.37,0.00,0.00,1.73,0.00,0.00
286,512,346482.74,346482.74,346482.74,0.00,0.00,1.73,0.00,0.00
287,512,346552.96,346552.96,346552.96,0.00,0.00,1.73,0.00,0.00
288,512,346364.72,346362.72,346362.72,0.00,0.00,1.79,0.00,0.00
289,512,346690.36,346692.36,346692.36,0.00,0.00,1.76,0.00,0.00
290,512,346961.29,346961.29,346961.29,0.00,0.00,1.73,0.00,0.00
291,512,346425.82,346423.82,346423.82,0.00,0.00,1.73,0.00,0.00
292,512,346396.39,346398.39,346398.39,0.00,0.00,1.76,0.00,0.00
293,512,346392.28,346392.28,346392.28,0.00,0.00,1.79,0.00,0.00
294,512,346482.11,346480.11,346480.11,0.00,0.00,1.79,0.00,0.00
295,512,346416.14,346418.14,346418.14,0.00,0.00,1.76,0.00,0.00
296,512,346274.08,346272.08,346272.08,0.00,0.00,1.73,0.00,0.00
297,512,346361.71,346363.71,346363.71,0.00,0.00,1.73,0.00,0.00
298,512,346309.42,346309.42,346309.42,0.00,0.00,1.73,0.00,0.00
299,512,346323.83,346322.83,346322.83,0.00,0.00,1.73,0.00,0.00
300,512,332184.04,332185.03,332185.03,0.00,0.00,1.73,0.00,0.00
SQL statistics:
    queries performed:
        read:                            103887393
        write:                           0
        other:                           0
        total:                           103887393
    transactions:                        103887393 (346188.77 per sec.)
    queries:                             103887393 (346188.77 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0874s
    total number of events:              103887393

Latency (ms):
         min:                                    0.05
         avg:                                    1.48
         max:                                  310.89
         95th percentile:                        1.73
         sum:                            153458678.85

Threads fairness:
    events (avg/stddev):           202905.0645/5789.21
    execution time (avg/stddev):   299.7240/0.05